lijunlang/CV-STM32/USER/src/iic.c
/***********************************************************************************************************************
Copyright 2008 - 2016 深圳市信盈达科技有限公司. All rights reserved.
文件名:        iic.c
描述   :       模拟iic
作者   :        
版本   :       V1.0
修改   :   
完成日期：     2016.9.19
************************************************************************************************************************/

/***********************************************************************************************************************
* INCLUDES
*/
#include "stm32f4xx.h"
#include "iic.h"
#include "delay.h"
/***********************************************************************************************************************
* CONSTANTS
*/
//IO方向设置
#define SDA_IN()  {GPIOB->MODER&=~(3<<(9*2));GPIOB->MODER|=0<<9*2;}	//PB9输入模式
#define SDA_OUT() {GPIOB->MODER&=~(3<<(9*2));GPIOB->MODER|=1<<9*2;} //PB9输出模式

#define SCL_H()  (GPIOB->BSRRL = 1<<8)
#define SCL_L()  (GPIOB->BSRRH = 1<<8)

#define SDA_H()  (GPIOB->BSRRL = 1<<9)
#define SDA_L()  (GPIOB->BSRRH = 1<<9)

#define RD_SDA() ((GPIOB->IDR & 1<<9)&&1)



/***********************************************************************************************************************
* TYPEDEFS
*/


/***********************************************************************************************************************
* LOCAL VARIABLES
*/

/***********************************************************************************************************************
* LOCAL FUNCTIONS  DECLARE
*/


/***********************************************************************************************************************
* LOCAL FUNCTIONS  
*/



/***********************************************************************************************************************
* PUBLIC FUNCTIONS
*/
/**********************************************************************************************************
* 函数名：        IIC_init
* 功能描述：      模拟iic管脚初始化
  
* 参数说明：  
* 返回值说明：
* 修改记录：
**********************************************************************************************************/
void IIC_init(void)
{					     
  RCC->AHB1ENR|=1<<1;    //使能PORTB时钟	   	  
	/* PB8---SCL */
	GPIOB->MODER &= ~(3<<16);
	GPIOB->MODER |= (1<<16);//PB8 通用输出
	
	GPIOB->OTYPER &= ~(1<<8);//PB8推挽输出
	GPIOB->PUPDR|= 1<<16;    //上拉
	GPIOB->OSPEEDR &= ~(3<<16);
	GPIOB->OSPEEDR |= (2<<16);	//50MHZ
	
	/* PB9---SDA */
	GPIOB->MODER &= ~(3<<18);
	GPIOB->MODER |= (1<<18);//PB9 通用输出
	
	GPIOB->OTYPER &= ~(1<<9);//PB9推挽输出
	GPIOB->PUPDR|= 1<<18;    //上拉
	GPIOB->OSPEEDR &= ~(3<<18);
	GPIOB->OSPEEDR |= (2<<18);	//50MHZ
  SCL_H();
  SDA_H();
}

/**********************************************************************************************************
* 函数名：        IIC_start
* 功能描述：      模拟iic启动信号
  
* 参数说明：      none
* 返回值说明：    none
* 修改记录：      
**********************************************************************************************************/
void IIC_start(void)
{ 

  SDA_OUT();      //sda线输出
  SDA_H();
  SCL_H();
  SDA_L();
  //快速IIC:延时0.6us  标准IIC: 延时4us
  delay_us(6);
}	
/**********************************************************************************************************
* 函数名：        IIC_stop
* 功能描述：      模拟iic停止信号
  
* 参数说明：      none
* 返回值说明：    none
* 修改记录：      
**********************************************************************************************************/
void IIC_stop(void)
{
	SDA_OUT();//sda线输出
	SCL_L();
	SDA_L();//STOP:when CLK is high DATA change form low to high
 	delay_us(4);
	SCL_H(); 
	delay_us(4);	
  SDA_H();//发送I2C总线结束信号

}
/**********************************************************************************************************
* 函数名：        IIC_waitAck
* 功能描述：      IIC master 等待应答信号
  
* 参数说明：      1，接收应答失败
*                0，接收应答成功
* 返回值说明：    none
* 修改记录：      
**********************************************************************************************************/
u8 IIC_waitAck(void)
{

	u8 ucErrTime=0;
	SDA_IN();      //SDA设置为输入  
	SDA_H();delay_us(1);	   
	SCL_H();delay_us(1);	 
	while(RD_SDA())
	{
		ucErrTime++;
		if(ucErrTime>250)
		{
			IIC_stop();
			return 1;
		}
	}
	SCL_L();//时钟输出0 	   
	return 0; 

} 
/**********************************************************************************************************
* 函数名：        IIC_ack
* 功能描述：      给应答信号
  
* 参数说明：      none
* 返回值说明：    none
* 修改记录：      
**********************************************************************************************************/
void IIC_ack(void)
{

  SCL_L();
  SDA_OUT();
  SDA_H();
	delay_us(2);      
	SDA_L();
	delay_us(3);
	SCL_H();	
	delay_us(4);
	SCL_L();
	delay_us(2); 
	SDA_H();

}
/**********************************************************************************************************
* 函数名：        IIC_nAck
* 功能描述：      不给应答信号
  
* 参数说明：      none
* 返回值说明：    none
* 修改记录：      
**********************************************************************************************************/
void IIC_nAck(void)
{

  SCL_L();
  SDA_OUT();
  SDA_H();
	delay_us(2);      
	SDA_H();
	delay_us(3);
	SCL_H();	
	delay_us(4);
	SCL_L();
	delay_us(2); 
	SDA_H();

  
}	
/**********************************************************************************************************
* 函数名：        IIC_sendByte
* 功能描述：      发送一个字节
  
* 参数说明：      none
* 返回值说明：    none
* 修改记录：      
**********************************************************************************************************/
void IIC_sendByte(u8 txd)
{ 

  u8 i; 
  SDA_OUT(); 	
  for(i=0;i<8;i++)//连续写8个位
  {
    SCL_L();
    if(txd&(1<<(7-i)))
    {
      SDA_H();
    }
    else
    {
      SDA_L();
    }
    //快速IIC:延时1.3us  标准IIC: 延时4.7us
    //delay_us(2);
    delay_us(3);
    SCL_H();
    //快速IIC:延时0.6us  标准IIC: 延时4us
    //delay_us(1);
    delay_us(3);
    SCL_L();
  }
  SDA_H();//释放管脚控制，等待应答
  

} 
/**********************************************************************************************************
* 函数名：        IIC_readByte
* 功能描述：      读取一个字节
  
* 参数说明：      ack=0时，发送ACK，ack=1，发送nACK
* 返回值说明：    返回读取到的数据
* 修改记录：      
**********************************************************************************************************/
u8 IIC_readByte(unsigned char ack)
{

  unsigned char i,receive=0;
  SDA_IN();//SDA设置为输入
  for(i=0;i<8;i++)//连续的读8个位
  {
    SCL_L();
    //快速IIC:延时1.3us  标准IIC: 延时4.7us		
    delay_us(5);
    SCL_H();
    //快速IIC:延时0.6us  标准IIC: 延时4us		
    delay_us(4);
    if(RD_SDA()==1)
    {
      receive |= (1<<(7-i));
    }
    else
    {
      receive &= ~(1<<(7-i));
    }
    SCL_L();
  }			 
  if (!ack)
    IIC_ack(); //发送ACK   
  else
    IIC_nAck();//发送nACK 
  return receive;

}

/***********************************************************************************************************************
***********************************************************************************************************************/
